let days = ["রবিবার", "সোমবার", "মঙ্গলবার", "বুধবার","বৃহস্পতিবার", "শুক্রবার", "শনিবার"];

let SCIENCE = [
  { // রবিবার
    "550": "পদার্থ বিজ্ঞান", "590": "ICT", "630": "উচ্চতর গণিত", "670": "ইংরেজি", "710": "জীববিজ্ঞান", "750": "রসায়ন", "790": "বাংলা", "830": "কৃষিশিক্ষা"
  },
  { // সোমবার
    "550": "উচ্চতর গণিত", "590": "জীববিজ্ঞান", "630": "ইংরেজি", "670": "রসায়ন", "710": "পদার্থ বিজ্ঞান", "750": "বাংলা", "790": "ICT", "830": "নাই"
  },
  { // মঙ্গলবার
    "550": "পদার্থ বিজ্ঞান", "590": "রসায়ন", "630": "বাংলা", "670": "জীববিজ্ঞান", "710": "উচ্চতর গণিত", "750": "ইংরেজি", "790": "কৃষিশিক্ষা", "830": "ICT"
  },
  { // বুধবার
    "550": "কৃষিশিক্ষা", "590": "উচ্চতর গণিত", "630": "রসায়ন", "670": "ইংরেজি", "710": "বাংলা", "750": "জীববিজ্ঞান", "790": "ICT", "830": "নাই"
  },
  { // বৃহস্পতিবার
    "550": "নাই", "590": "বাংলা", "630": "জীববিজ্ঞান", "670": "রসায়ন", "710": "ইংরেজি", "750": "ICT", "790": "নাই", "830": "ইসলাম শিক্ষা"
  },
  { "550": "নাই", "590": "নাই", "630": "নাই", "670": "নাই", "710": "নাই", "750": "নাই", "790": "নাই", "830": "নাই" }, // শুক্রবার
  { "550": "নাই", "590": "নাই", "630": "নাই", "670": "নাই", "710": "নাই", "750": "নাই", "790": "নাই", "830": "নাই" }  // শনিবার
];

let ARTS = [
  { // রবিবার
    "550": "পৌরনীতি", "590": "ICT", "630": "সমাজ বিজ্ঞান", "670": "ইংরেজি", "710": "ভূগোল", "750": "ইতিহাস", "790": "বাংলা", "830": "কৃষিশিক্ষা"
  },
  { // সোমবার
    "550": "ইসলাম শিক্ষা", "590": "অর্থনীতি", "630": "ইংরেজি", "670": "ইতিহাস", "710": "সমাজ বিজ্ঞান", "750": "বাংলা", "790": "ICT", "830": "ভূগোল"
  },
  { // মঙ্গলবার
    "550": "ইতিহাস", "590": "পৌরনীতি", "630": "বাংলা", "670": "সমাজ বিজ্ঞান", "710": "ভূগোল", "750": "ইংরেজি", "790": "ইসলাম শিক্ষা", "830": "ICT"
  },
  { // বুধবার
    "550": "কৃষিশিক্ষা", "590": "ভূগোল", "630": "অর্থনীতি", "670": "ইংরেজি", "710": "বাংলা", "750": "যুক্তিবিদ্যা", "790": "ICT", "830": "পৌরনীতি"
  },
  { // বৃহস্পতিবার
    "550": "পৌরনীতি", "590": "বাংলা", "630": "ভূগোল", "670": "ইতিহাস", "710": "ইংরেজি", "750": "ICT", "790": "সমাজ বিজ্ঞান", "830": "ইসলাম শিক্ষা"
  },
  { "550": "নাই", "590": "নাই", "630": "নাই", "670": "নাই", "710": "নাই", "750": "নাই", "790": "নাই", "830": "নাই" }, // শুক্রবার
  { "550": "নাই", "590": "নাই", "630": "নাই", "670": "নাই", "710": "নাই", "750": "নাই", "790": "নাই", "830": "নাই" }  // শনিবার
];

let COMMERCE = [
  { // রবিবার
    "550": "নাই", "590": "ICT", "630": "ব্যবসায় নীতি", "670": "ইংরেজি", "710": "হিসাববিজ্ঞান", "750": "উৎপাদন ব্যবস্থাপনা", "790": "বাংলা", "830": "কৃষিশিক্ষা"
  },
  { // সোমবার
    "550": "ইসলাম শিক্ষা", "590": "ব্যবসায় সংগঠন", "630": "ইংরেজি", "670": "উৎপাদন ব্যবস্থাপনা", "710": "হিসাববিজ্ঞান", "750": "বাংলা", "790": "ICT", "830": "নাই"
  },
  { // মঙ্গলবার
    "550": "উৎপাদন ব্যবস্থাপনা", "590": "অর্থনীতি", "630": "বাংলা", "670": "হিসাববিজ্ঞান", "710": "ব্যবসায় সংগঠন", "750": "ইংরেজি", "790": "ইসলাম শিক্ষা", "830": "ICT"
  },
  { // বুধবার
    "550": "কৃষিশিক্ষা", "590": "উৎপাদন ব্যবস্থাপনা", "630": "হিসাববিজ্ঞান", "670": "ইংরেজি", "710": "বাংলা", "750": "ব্যবসায় সংগঠন", "790": "ICT", "830": "নাই"
  },
  { // বৃহস্পতিবার
    "550": "উৎপাদন ব্যবস্থাপনা", "590": "বাংলা", "630": "হিসাববিজ্ঞান", "670": "ব্যবসায় সংগঠন", "710": "ইংরেজি", "750": "ICT", "790": "ব্যবসায় নীতি", "830": "ইসলাম শিক্ষা"
  },
  { "550": "নাই", "590": "নাই", "630": "নাই", "670": "নাই", "710": "নাই", "750": "নাই", "790": "নাই", "830": "নাই" }, // শুক্রবার
  { "550": "নাই", "590": "নাই", "630": "নাই", "670": "নাই", "710": "নাই", "750": "নাই", "790": "নাই", "830": "নাই" }  // শনিবার
];

function updateUserName() {
    let user = JSON.parse(localStorage.getItem('user')) || {'user': 'নাই'};
    let username = user.user; 
    let uidElement = document.querySelector('.uid');
    
    if (uidElement) {
        uidElement.textContent = username;
    }
    }
   
