let days = ["রবিবার", "সোমবার", "মঙ্গলবার", "বুধবার","বৃহস্পতিবার", "শুক্রবার", "শনিবার"];

let SCIENCE = [
  { // রবিবার
    "550": "জীববিজ্ঞান", "590": "পদার্থ বিজ্ঞান", "630": "বাংলা", "670": "রসায়ন", "710": "উচ্চতর গণিত", "750": "ইংরেজি", "790": "ICT", "830": "নাই"
  },
  { // সোমবার
    "550": "বাংলা", "590": "উচ্চতর গণিত", "630": "রসায়ন", "670": "পদার্থ বিজ্ঞান", "710": "জীববিজ্ঞান", "750": "নাই", "790": "ইংরেজি", "830": "ইসলাম শিক্ষা"
  },
  { // মঙ্গলবার
    "550": "রসায়ন", "590": "পদার্থ বিজ্ঞান", "630": "উচ্চতর গণিত", "670": "ইংরেজি", "710": "বাংলা", "750": "জীববিজ্ঞান", "790": "নাই", "830": "কৃষিশিক্ষা"
  },
  { // বুধবার
    "550": "জীববিজ্ঞান", "590": "পদার্থ বিজ্ঞান", "630": "ICT", "670": "রসায়ন", "710": "উচ্চতর গণিত", "750": "ইংরেজি", "790": "বাংলা", "830": "কৃষিশিক্ষা"
  },
  { // বৃহস্পতিবার
    "550": "নাই", "590": "ICT", "630": "রসায়ন", "670": "বাংলা", "710": "উচ্চতর গণিত", "750": "জীববিজ্ঞান", "790": "ইংরেজি", "830": "নাই"
  },
  { "550": "নাই", "590": "নাই", "630": "নাই", "670": "নাই", "710": "নাই", "750": "নাই", "790": "নাই", "830": "নাই" },
  { "550": "নাই", "590": "নাই", "630": "নাই", "670": "নাই", "710": "নাই", "750": "নাই", "790": "নাই", "830": "নাই" }  // শনিবার
];

let ARTS = [
  { // রবিবার
    "550": "ইসলাম শিক্ষা", "590": "ভূগোল", "630": "বাংলা", "670": "সমাজ বিজ্ঞান", "710": "যুক্তিবিদ্যা", "750": "ইংরেজি", "790": "ICT", "830": "পৌরনীতি"
  },
  { // সোমবার
    "550": "বাংলা", "590": "ইতিহাস", "630": "ভূগোল", "670": "পৌরনীতি", "710": "যুক্তিবিদ্যা", "750": "সমাজ বিজ্ঞান", "790": "ইংরেজি", "830": "ইসলাম শিক্ষা"
  },
  { // মঙ্গলবার
    "550": "যুক্তিবিদ্যা", "590": "ইতিহাস", "630": "সমাজ বিজ্ঞান", "670": "ইংরেজি", "710": "বাংলা", "750": "পৌরনীতি", "790": "ভূগোল", "830": "কৃষিশিক্ষা"
  },
  { // বুধবার
    "550": "অর্থনীতি", "590": "ইসলাম শিক্ষা", "630": "ICT", "670": "ইতিহাস", "710": "ভূগোল", "750": "ইংরেজি", "790": "বাংলা", "830": "কৃষিশিক্ষা"
  },
  { // বৃহস্পতিবার
    "550": "ইতিহাস", "590": "ICT", "630": "সমাজ বিজ্ঞান", "670": "বাংলা", "710": "ভূগোল", "750": "পৌরনীতি", "790": "ইংরেজি", "830": "যুক্তিবিদ্যা"
  },
  { "550": "নাই", "590": "নাই", "630": "নাই", "670": "নাই", "710": "নাই", "750": "নাই", "790": "নাই", "830": "নাই" }, // শুক্রবার
  { "550": "নাই", "590": "নাই", "630": "নাই", "670": "নাই", "710": "নাই", "750": "নাই", "790": "নাই", "830": "নাই" }  // শনিবার
];

let COMMERCE = [
  { // রবিবার
    "550": "ইসলাম শিক্ষা", "590": "হিসাববিজ্ঞান", "630": "বাংলা", "670": "নাই", "710": "অর্থনীতি", "750": "ইংরেজি", "790": "ICT", "830": "নাই"
  },
  { // সোমবার
    "550": "বাংলা", "590": "নাই", "630": "নাই", "670": "হিসাববিজ্ঞান", "710": "অর্থনীতি", "750": "নাই", "790": "ইংরেজি", "830": "ইসলাম শিক্ষা"
  },
  { // মঙ্গলবার
    "550": "ইসলাম শিক্ষা", "590": "নাই", "630": "হিসাববিজ্ঞান", "670": "ইংরেজি", "710": "বাংলা", "750": "নাই", "790": "নাই", "830": "কৃষিশিক্ষা"
  },
  { // বুধবার
    "550": "অর্থনীতি", "590": "হিসাববিজ্ঞান", "630": "ICT", "670": "নাই", "710": "নাই", "750": "ইংরেজি", "790": "বাংলা", "830": "কৃষিশিক্ষা"
  },
  { // বৃহস্পতিবার
    "550": "নাই", "590": "ICT", "630": "নাই", "670": "বাংলা", "710": "নাই", "750": "হিসাববিজ্ঞান", "790": "ইংরেজি", "830": "অর্থনীতি"
  },
  { "550": "নাই", "590": "নাই", "630": "নাই", "670": "নাই", "710": "নাই", "750": "নাই", "790": "নাই", "830": "নাই" }, // শুক্রবার
  { "550": "নাই", "590": "নাই", "630": "নাই", "670": "নাই", "710": "নাই", "750": "নাই", "790": "নাই", "830": "নাই" }  // শনিবার
];

function updateUserName() {
    
    let user = JSON.parse(localStorage.getItem('user')) || {'user': 'nai'};
    let username = user.user; 
    document.querySelector('.uid').textContent = username
    
  }
